package com.example.bmi

class Database {
    val underweightText = "Недостаточная (дефицит) масса тела: менее 19 \n" +
            "  \n " +
            "Рекомендации:\n +" +
            "     Питание:\n" +
            "        ◦ Увеличьте калорийность рациона\n" +
            "        ◦ Питайтесь чаще, 5-6 небольших приемов пищи в течение дня.\n" +
            "        ◦ Употребляйте больше белков (мясо, яйца, молочные продукты, рыба,) для наращивания мышечной массы.\n" +
            "        ◦ Добавляйте в пищу здоровые углеводы, такие как цельнозерновые продукты, фрукты и овощи.\n" +
            "     Физическая активность:\n" +
            "        ◦ Силовые тренировки для увеличения мышечной массы, но без значительной кардионагрузки\n" +
            "        ◦ Регулярные упражнения помогут укрепить мышцы и улучшить аппетит.\n" +
            "        ◦ Консультируйтесь с врачом или диетологом для составления индивидуального плана питания и упражнений."

    val normalText = "Нормальный вес: 19-24\n" +
            "  \n " +
            "Рекомендации:\n "+
            "  \n " +
            "    • Питание:\n" +
            "        ◦ Сбалансированный рацион с правильным соотношением белков, жиров и углеводов.\n" +
            "        ◦ Регулярное потребление фруктов и овощей, цельнозерных продуктов\n" + "     " +
            "        ◦ Ограничьте потребление сахара и насыщенных жиров.\n" +
            "    • Физическая активность:\n" +
            "        ◦ Регулярная физическая активность (не менее 150 минут умеренной аэробной активности или 75 минут интенсивной активности в неделю).\n" +
            "        ◦ Силовые упражнения для укрепления мышц.\n" +
            "        ◦ Избегание стрессов и активный образ жизни.\n" +
            "        ◦ Пейте достаточное количество воды. \n " +
            "  \n " +"" +
            ""

    val overweightText = "Избыточная масса тела (предожирение): 24-30\n" +
            "  \n " +
            "Рекомендации:\n" +
            "    • Питание:\n" +
            "        ◦ Уменьшите калорийность рациона, объем порций.\n" +
            "        ◦ Увеличьте потребление овощей и фруктов.\n" +
            "        ◦ Предпочитайте нежирные источники белка, такие как курица, рыба, бобовые.\n" +
            "        ◦ Ограничьте потребление сладостей, газированных напитков и продуктов с высоким содержанием жиров.\n" +
            "    • Физическая активность:\n" +
            "        ◦ Регулярная физическая активность (ходьба, бег, плавание, велосипед) не менее 150 минут в неделю.\n" +
            "        ◦ Силовые тренировки 2-3 раза в неделю.\n" +
            "        ◦ Следите за весом и поддерживайте его в пределах здорового диапазона."

    val superoverweightText = "Ожирение: больше 30  \n" +
            "  \n " +
            "Рекомендации:\n" +
            "    • Питание:\n" +
            "        ◦ Снизьте калорийность рациона, избегая переработанных продуктов, сахара и насыщенных жиров.\n" +
            "        ◦ Увеличьте потребление овощей, фруктов, нежирных белков и цельнозерновых продуктов.\n" +
            "        ◦ Ешьте часто и небольшими порциями.\n" +
            "        ◦ Пейте больше воды и избегайте сладких напитков.\n" +
            "    • Физическая активность:\n" +
            "        ◦ Увеличьте физическую активность до 3 часов умеренной активности или  1,5 часа  интенсивной активности в неделю.\n" +
            "        ◦ Включайте силовые тренировки для улучшения мышечной массы.\n" +
            "        ◦ Консультируйтесь с врачом или диетологом для создания индивидуальной программы похудения."

    }

